Ah, good point. I should have probably included a code example here as, like you say, this perpetual diff problem is something easy to get into with this resource.

I don't think the problem here is actually that the parameter is marked as `sensitive`, I think it could be because when you're reading back from Vault it doesn't have the same fields as the ones you've written, or in some other way does not exactly match.
But I'd need to see your particular TF config to know for sure.
(And that's maybe a conversation for the other Issue)


Here's my example config from my own Vault:

```
resource "vault_generic_endpoint" "pki_inter-auto-tidy" {
  path = "${vault_mount.pki_inter.path}/config/auto-tidy"

  # We're not configuring all available options here, just some of them
  # so ignore things which are returned from Vault which we didn't explicitly set
  ignore_absent_fields = true

  data_json = <<EOT
{
  "enabled": true,
  "tidy_cert_store": true,
  "safety_buffer": 86400
}
EOT
}
```

Using:

```
$ terraform version
Terraform v1.4.4
on darwin_amd64
..
+ provider registry.terraform.io/hashicorp/vault v3.12.0
```


First plan:

```
Terraform will perform the following actions:

  # vault_generic_endpoint.pki_inter-auto-tidy will be created
  + resource "vault_generic_endpoint" "pki_inter-auto-tidy" {
      + data_json            = (sensitive value)
      + disable_delete       = false
      + disable_read         = false
      + id                   = (known after apply)
      + ignore_absent_fields = true
      + path                 = "pki/inter/config/auto-tidy"
      + write_data           = (known after apply)
      + write_data_json      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Second plan:

```
No changes. Your infrastructure matches the configuration.
```



In my case, I was originally using the following `data_json`:

```
{
  "enabled": true,
  "tidy_cert_store": true,
  "safety_buffer": "24h"
}
```

which DID result in that perpetual diff issue you were seeing. But that's because the API was returning `"safety_buffer": 86400`